app/assets/xml_templates/get_auction_list.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <GetAuctionList xmlns="GdAuctionsBiddingWSAPI_v2">
      <pageNumber>PAGE_NUMBER</pageNumber>
      <rowsPerPage>ROWS_PER_PAGE</rowsPerPage>
      <beginsWithKeyword>BEGINS_WITH_KEYWORD</beginsWithKeyword>
    </GetAuctionList>
  </soap12:Body>
</soap12:Envelope>
